package types.type16;

/**
 * Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:
 * F(1) = 1; F(2) = 1;
 * F(n) = F(n - 2) * (n - 1), при n > 2.
 * Чему равно значение функции F(21)? В ответе запишите только натуральное число.
 * */
public class Task4937 {
    public static void main(String[] args) {

        // Заменить на решение, при решении допускается создание дополнительных методов

        System.out.println("Привет мир!");
    }
}